{
  "backend/main.mo": "Motoko canister defining products, categories, orders, user profiles, menu seeding, and authorization‑protected admin/user operations.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files across the app.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables and light/dark mode palettes.",
  "frontend/index.html": "Base HTML document setting metadata, Open Graph tags, and loading the React application.",
  "frontend/src/App.tsx": "Main React router setup defining routes, layout, admin‑protected sections, and global providers.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart items with localStorage persistence and helper methods for updates.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks admin privileges or login, with optional error messaging.",
  "frontend/src/components/auth/AdminGuard.tsx": "Route guard that checks authentication and admin status, showing skeletons or access‑denied states when appropriate.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity and clears React Query cache on logout with error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal prompting authenticated users without profiles to enter their name and save their profile.",
  "frontend/src/components/brand/PremiumTagline.tsx": "Renders the brand’s tagline pulled from cafe37Content.",
  "frontend/src/components/catalog/CatalogOnlyMessage.tsx": "Shows an alert explaining ordering is done through partners and provides Zomato, WhatsApp, and phone links.",
  "frontend/src/components/home/HomePromoCarousel.tsx": "Implements an autoplaying image carousel with hover pause, slide tracking, and fallback UI for failed images.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with branding, contact info, quick links, social sharing, and Google ratings.",
  "frontend/src/components/nav/Header.tsx": "Provides the site header with navigation, mobile menu, branding, login, and conditional admin link.",
  "frontend/src/components/ordering/OnlineOrderingSection.tsx": "Shows ordering options via Zomato, WhatsApp, or phone in default or compact layouts.",
  "frontend/src/components/orders/OrderViaContactCTA.tsx": "Displays a dialog-based CTA letting users order via WhatsApp or phone for a specific product.",
  "frontend/src/components/products/CategoryFilter.tsx": "Renders category filter buttons allowing selection of item categories or all items.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image, name, description, price, availability badge, and contact order CTA.",
  "frontend/src/components/reviews/GoogleRatingSummary.tsx": "Fetches and displays Google rating info in multiple layout variants with fallback messaging and optional link.",
  "frontend/src/components/states/ErrorState.tsx": "Renders an error alert with title, message, and optional retry button.",
  "frontend/src/components/states/LoadingSkeleton.tsx": "Provides skeleton loaders for product cards, product grids, and tables.",
  "frontend/src/content/cafe37.ts": "Exports static Cafe 37 business info including hours, address, contact links, and highlights.",
  "frontend/src/content/homepageSlides.ts": "Defines homepage slide data with IDs, images, titles, and descriptions.",
  "frontend/src/content/menuCategories.ts": "Contains legacy hardcoded menu categories and a helper to resolve display names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch products, categories, menus, catalog data, and create orders using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom CSS variables for light/dark themes, base typography, and utility classes including accessibility and scrollbar helpers.",
  "frontend/src/main.tsx": "Initializes React root, wraps the app with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the café’s About page with hero section, story content, feature highlights, and an image.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Provides CRUD management for product categories with dialogs, form handling, and error/loading states.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin dashboard stats for products, categories, menu items, and orders, with navigation to management sections and error/loading indicators.",
  "frontend/src/pages/admin/AdminEditMenuPage.tsx": "Displays and allows seeding of legacy menu data, with category selection and loading/error handling.",
  "frontend/src/pages/admin/AdminGoogleReviewsPage.tsx": "Lets admins configure Google Places API keys and fallback messaging for review display, with form validation and update handling.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin order detail page that loads an order by ID, handles loading/error states, and displays items and customer info.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders list showing all orders with loading/error states and navigation to individual order details.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page with CRUD dialogs, form handling, and product catalog loading.",
  "frontend/src/pages/CartPage.tsx": "Displays an order prompt with online ordering options and a button to navigate to the menu.",
  "frontend/src/pages/CatalogPage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/CheckoutPage.tsx": "Same layout as CartPage, offering ordering options and a link back to the menu.",
  "frontend/src/pages/ContactPage.tsx": "Shows location map, contact actions, facilities list, and general visit info for the café.",
  "frontend/src/pages/HomePage.tsx": "Home landing page with hero content, contact shortcuts, promo carousel, and café highlights.",
  "frontend/src/pages/MenuRedirectPage.tsx": "Immediately redirects users to the /menu route while showing a loading indicator.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays product details with loading and error states, image, price, description, and contact-based ordering.",
  "frontend/src/pages/TextMenuPage.tsx": "Displays a scrollable public menu by grouping products into category sections, handling loading/error states, and enabling smooth navigation between sections.",
  "frontend/src/utils/businessHours.ts": "Utility for business hours including schedule data, open/closed checks, and formatted outputs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and content paths.",
  "project_state.json": "Project metadata describing versioning, features, requests, and admin dashboard-related project state."
}