{
  "backend/main.mo": "Motoko backend defining products, categories, orders, user profiles, access control, and menu seeding with admin/user authorization checks.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files for documentation or build planning.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark mode tokens for global styling.",
  "frontend/index.html": "Base HTML document mounting the React app with metadata and Open Graph tags.",
  "frontend/src/App.tsx": "Root React router configuration with layout, menu redirect, main pages, and admin-protected routes.",
  "frontend/src/cart/CartProvider.tsx": "React context providing cart state with localStorage persistence and item/quantity management.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks admin access, offering login and navigation options.",
  "frontend/src/components/auth/AdminGuard.tsx": "Route guard that checks identity and admin status, showing loading skeleton or denial screen when appropriate.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save their name. Handles form submission, validation, and success/error toasts.",
  "frontend/src/components/brand/PremiumTagline.tsx": "Displays the brand tagline from cafe37 content as muted text.",
  "frontend/src/components/catalog/CatalogOnlyMessage.tsx": "Shows an alert explaining that orders must be placed via partner platforms and provides buttons linking to Zomato, WhatsApp, and phone.",
  "frontend/src/components/home/HomePromoCarousel.tsx": "Homepage carousel with autoplay, hover pause, and fallback UI for failed images, cycling through promo slides.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying cafe info, quick links, contact details, rating summary, and social sharing actions.",
  "frontend/src/components/nav/Header.tsx": "Sticky site header with navigation links, branding, login button, mobile menu, and optional admin link.",
  "frontend/src/components/ordering/OnlineOrderingSection.tsx": "Component showing Zomato, WhatsApp, and phone ordering options, with compact and full variants.",
  "frontend/src/components/orders/OrderViaContactCTA.tsx": "Dialog-triggering CTA button letting users order an item via WhatsApp or phone.",
  "frontend/src/components/products/CategoryFilter.tsx": "Renders category filter buttons allowing users to select or clear a product category.",
  "frontend/src/components/products/ProductCard.tsx": "Product card showing image, details, availability, price, and contact-based ordering CTA.",
  "frontend/src/components/reviews/GoogleRatingSummary.tsx": "Displays Google rating info in multiple visual variants, using fetched rating data with fallbacks and optional external link.",
  "frontend/src/components/states/ErrorState.tsx": "Renders an error alert with title, message, and optional retry button.",
  "frontend/src/components/states/LoadingSkeleton.tsx": "Provides skeleton loaders for product cards, grids, and tables.",
  "frontend/src/content/cafe37.ts": "Exports Cafe 37 business info including hours, contact, links, and highlights.",
  "frontend/src/content/homepageSlides.ts": "Defines and exports an array of homepage slide objects with images and text.",
  "frontend/src/content/menuCategories.ts": "Contains legacy hardcoded menu categories and a helper to map category IDs to display names.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for products, categories, menu, and orders.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode tokens, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the café's About page with sections for story, features, and an image hero using content from cafe37Content.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Category management page with CRUD dialogs, loading/error states, and table display.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing product, category, menu, and order statistics plus navigation cards.",
  "frontend/src/pages/admin/AdminEditMenuPage.tsx": "Displays seeded menu data, allows seeding test menu items, and lets users browse categories and items.",
  "frontend/src/pages/admin/AdminGoogleReviewsPage.tsx": "Form page for configuring Google Reviews API settings with validation and update handling.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Displays detailed order info including items, totals, and customer details with loading/error handling.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders in a table with loading/error states and links to order detail pages.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page component for listing, creating, editing, and deleting products using query hooks and modal dialogs.",
  "frontend/src/pages/CartPage.tsx": "Displays a simple cart/ordering page with external ordering options and a button to browse the menu.",
  "frontend/src/pages/CatalogPage.tsx": "File is empty and contains no implementation.",
  "frontend/src/pages/CheckoutPage.tsx": "Identical to CartPage, showing ordering options and a link to the menu.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact info, map embed, quick action buttons, and facility details using cafe37Content and business hours utilities.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, ratings, contact buttons, promo carousel, and highlights sourced from cafe37Content.",
  "frontend/src/pages/MenuRedirectPage.tsx": "Immediately redirects users to /menu while showing a loading indicator.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product info with loading/error states and a CTA to order via contact.",
  "frontend/src/pages/TextMenuPage.tsx": "Loads product catalog, groups items by category, and renders a scrollable text-based menu with section navigation.",
  "frontend/src/utils/businessHours.ts": "Defines weekly business hours and utilities to get today's hours, formatted schedules, and open/closed status.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings for the frontend.",
  "project_state.json": "Metadata describing project state, priorities, and a request to restore the admin dashboard and reconnect it to dynamic menu data."
}