{
  "backend/main.mo": "Motoko canister managing products, categories, orders, and user profiles with admin/user authorization checks and CRUD operations.",
  "feature_evidence.json": "Feature evidence report linking a homepage hero image update to affected frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend files across the app.",
  "frontend/index.css": "Tailwind CSS setup defining global color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, admin-guarded pages, global layout, theming, and providers.",
  "frontend/src/cart/CartProvider.tsx": "React context managing cart state with localStorage persistence and item/quantity operations.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when admin access is denied, with login prompt and optional error message.",
  "frontend/src/components/auth/AdminGuard.tsx": "Wrapper component restricting access to admin-only routes using identity and admin-check logic.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, errors, and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to enter a name and saves the profile via API mutation.",
  "frontend/src/components/brand/PremiumTagline.tsx": "Displays a small premium dining tagline text.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with a copyright notice.",
  "frontend/src/components/nav/Header.tsx": "Renders the main site header with navigation, branding, admin link, cart button, and mobile menu handling.",
  "frontend/src/components/products/CategoryFilter.tsx": "Shows category buttons allowing users to filter products by category.",
  "frontend/src/components/products/ProductCard.tsx": "Displays product details, image, price, availability, and supports navigation and adding to cart.",
  "frontend/src/components/states/ErrorState.tsx": "Shows an error alert with optional retry action.",
  "frontend/src/components/states/LoadingSkeleton.tsx": "Provides skeleton loaders for product cards, grids, and tables.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor instance tied to Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, stored identity loading, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, categories, orders, and user profile data via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles, custom CSS variables for theming, and global typography rules.",
  "frontend/src/main.tsx": "Initializes React app with React Query and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for listing, creating, editing, and deleting categories using dialogs, form handling, and server mutations.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with product, category, and order stats plus quick-action links. Fetches counts using query hooks and displays them in cards.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Displays detailed information for a single order, including items and customer data, with loading and error states. Allows navigating back to the orders list.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows a table of all orders with loading and error handling. Supports navigation to individual order detail pages.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages product CRUD operations with dialogs for creation and editing, category selection, and product seeding. Displays products in a table with loading and error handling.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, removal options, and total pricing; handles empty-cart and navigation states.",
  "frontend/src/pages/CatalogPage.tsx": "Fetches and filters product catalog by category, shows loading or error states, and lets users add products to the cart.",
  "frontend/src/pages/CheckoutPage.tsx": "Processes checkout by validating user input, creating an order, clearing the cart, and showing confirmation or errors.",
  "frontend/src/pages/HomePage.tsx": "Provides a marketing-focused landing page with a hero section and feature highlights, linking users to the catalog.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Loads and displays product details with add-to-cart functionality, handling loading, error, and out‑of‑stock states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, supporting hash and query-string routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings, and enabling additional plugins.",
  "project_state.json": "Defines the project’s schema, overall system description, and a list of implemented features covering backend canister APIs, RBAC, admin bootstrap, and CRUD operations for products and categories. Serves as a structured registry of feature IDs, descriptions, and versions."
}