{
  "backend/main.mo": "Motoko canister managing products, categories, orders, and user profiles with admin/user authorization and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping branding, business-hours, and metadata updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend components, hooks, pages, and admin tools.",
  "frontend/index.css": "Global Tailwind-based theme variables defining light/dark color systems and base styling.",
  "frontend/index.html": "HTML entry file setting SEO metadata and Open Graph tags reflecting the CAFE 37 branding and tagline.",
  "frontend/src/App.tsx": "Main app router and layout setup including public pages, admin routes protected by AdminGuard, and global providers.",
  "frontend/src/cart/CartProvider.tsx": "React context providing cart state, persistence, and operations for adding, updating, and removing items.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks admin privileges, offering login and navigation options.",
  "frontend/src/components/auth/AdminGuard.tsx": "Checks identity and admin status, showing a loading skeleton or access denied screen before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with retry and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Prompts new authenticated users to enter their name and saves the profile via mutation.",
  "frontend/src/components/brand/PremiumTagline.tsx": "Displays the cafe’s tagline from shared content.",
  "frontend/src/components/layout/Footer.tsx": "Renders footer with cafe info, links, and social/share actions using cafe37 content.",
  "frontend/src/components/nav/Header.tsx": "Displays site header with navigation, cart button, login, and admin link when applicable.",
  "frontend/src/components/products/CategoryFilter.tsx": "Renders category filter buttons allowing selection of a specific product category or all.",
  "frontend/src/components/products/ProductCard.tsx": "Shows a product image, details, and add‑to‑cart button with navigation to the product page.",
  "frontend/src/components/states/ErrorState.tsx": "Displays an error alert with optional retry action.",
  "frontend/src/components/states/LoadingSkeleton.tsx": "Provides skeleton loaders for product cards, grids, and tables.",
  "frontend/src/content/cafe37.ts": "Contains static and computed metadata about Cafe 37 including hours, contact info, and highlights.",
  "frontend/src/content/menuCategories.ts": "Defines menu categories and a helper to resolve display names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, categories, orders, and related backend data via an actor.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables, and global typography for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the café’s About page with story, features, and branded content sections.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Allows admins to view, create, edit, and delete product categories with dialog-based forms and table listings.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin stats for products, categories, and orders, plus quick navigation actions and setup guidance.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin page that fetches and displays details for a single order, including items, totals, and customer info with loading and error states.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays a list of all orders with loading/error handling and navigation to order detail pages.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for viewing, creating, editing, deleting, and seeding products, including a modal-based form and category selection.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, allowing quantity updates, item removal, and navigation to the catalog.",
  "frontend/src/pages/CatalogPage.tsx": "Shows the menu catalog with category filtering, product listing, and add‑to‑cart interactions.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with form validation, order submission, cart clearing, and confirmation display.",
  "frontend/src/pages/ContactPage.tsx": "Displays café contact info, map embed, quick action buttons, and facility details.",
  "frontend/src/pages/HomePage.tsx": "Renders the café landing page with hero content, action buttons, highlights, and promo messaging.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and shows a product’s details with add‑to‑cart support, loading states, and error handling.",
  "frontend/src/utils/businessHours.ts": "Defines weekly business hours and helper functions to format schedules, determine today's hours, and check if the café is currently open.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings for the project.",
  "project_state.json": "JSON file describing project state, features, pending requests, and metadata for the CAFE 37 site."
}