{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Café 37 branding strings and weekly business hours across the site",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all displayed café title/tagline with \"CAFE 37\" and \"The ultimate hangout cafe\" using a shared content source.",
      "acceptanceCriteria": [
        "Home page hero heading displays exactly \"CAFE 37\" and the subtitle/tagline displays exactly \"The ultimate hangout cafe\".",
        "Header brand text displays \"CAFE 37\" as the visible café name.",
        "Footer brand block displays \"CAFE 37\" and \"The ultimate hangout cafe\".",
        "Any dedicated tagline component no longer shows the old tagline and instead displays \"The ultimate hangout cafe\" (or reads it from the shared content source)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/cafe37.ts",
          "operation": "modify",
          "description": "Update shared branding fields so the canonical displayed name is \"CAFE 37\" and the canonical tagline is \"The ultimate hangout cafe\"; ensure other parts of the app that reference cafe37Content pick up the new strings."
        },
        {
          "path": "frontend/src/components/brand/PremiumTagline.tsx",
          "operation": "modify",
          "description": "Update PremiumTagline to render the tagline from the shared cafe37Content source (or replace the hardcoded text) so it displays exactly \"The ultimate hangout cafe\" wherever used."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the hero heading uses the updated shared title (\"CAFE 37\") and the hero subtitle uses the updated shared tagline (\"The ultimate hangout cafe\")."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Ensure the footer brand block and share text use the updated shared title/tagline strings (\"CAFE 37\" / \"The ultimate hangout cafe\")."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update hours to a weekly schedule (Fri–Sun 12 pm–12 am; Mon–Thu 1 pm–12 am) and display it consistently on Contact, Footer, and Home hours line.",
      "acceptanceCriteria": [
        "Contact page “Hours” section displays the full weekly schedule with the exact times provided for each day.",
        "Footer hours/open info reflects the new schedule (no longer only “Closes at 12:00 AM” unless additionally shown alongside the schedule).",
        "Home page hours/open status line reflects the new hours (e.g., shows today’s open/close window or otherwise clearly matches the new schedule).",
        "All displayed times use the same formatting as provided (12 pm–12 am; 1 pm–12 am)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/businessHours.ts",
          "operation": "create",
          "description": "Add a small business-hours utility to represent the weekly schedule and provide helpers to (1) format the weekly schedule for UI rendering and (2) compute today’s hours string in the required format (\"12 pm–12 am\" / \"1 pm–12 am\")."
        },
        {
          "path": "frontend/src/content/cafe37.ts",
          "operation": "modify",
          "description": "Replace the single closingTime usage with a weekly business-hours schedule matching: Friday–Sunday 12 pm–12 am; Monday–Thursday 1 pm–12 am; keep formatting consistent with the provided strings."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update the “Hours” section to display the full weekly schedule (all days) using the shared schedule source and formatting exactly as provided."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update footer hours/open info to reflect the new weekly schedule (display the weekly schedule, and remove or de-emphasize the old single “Closes at 12:00 AM” only line unless shown alongside the schedule)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Home hero hours/open status line to reflect the new schedule (e.g., show today’s window derived from the weekly schedule) and ensure the displayed time format matches exactly \"12 pm–12 am\" / \"1 pm–12 am\"."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update HTML metadata (title/description/OG) to align with \"CAFE 37\" and \"The ultimate hangout cafe\" branding.",
      "acceptanceCriteria": [
        "The document <title> includes \"CAFE 37\".",
        "Meta description and Open Graph title/description no longer reference the old primary name/tagline and instead reflect \"CAFE 37\" and/or \"The ultimate hangout cafe\" consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document <title>, meta description, and Open Graph title/description to consistently reflect \"CAFE 37\" and \"The ultimate hangout cafe\" (remove references to the old primary name/tagline)."
        }
      ]
    }
  ]
}